org/roam/cryptocurrency.org
:PROPERTIES:
:ID:       bfb58ea0-5328-4dca-9cf4-a162d37bb9d0
:END:
#+title: cryptocurrency
#+OPTIONS: toc:nil num:nil date:nil \n:nil html-style:nil author:nil timestamp:nil title:nil html-postamble:nil html5-fancy:t
#+HTML_HEAD: <link rel="stylesheet" type="text/css" href="org-default.css" />
#+HTML_CONTENT_CLASS: container
#+HTML_DOCTYPE: html5
#+INCLUDE: "css.org::navbar" :only-contents t
* notes
- fallacies of crypto haters
  - wrought with fraud so it needs 'regulation'
    - banks are the biggest scamming hucksters around and they facilitate most of financial fraud in the world within 'regulations'
  - not decentralized
    - 'people do not want to run their own servers' - moxie marlinspike
      - they will and do; a nakamoto number greater than 1 is still more than the status quo
- fallacies of crypto bros
  - 'trapped energy'
    - sets lower bound on energy production price beyond the government; thus encourages more production regardless of means
    - wasting compute cycles on hashing random numbers instead of folding proteins, simulating fluid dynamics, SETI etc (need internet connection for blockchain sync); price should not be the primary factor for investing in hard research problems.
- cross group discrete logarithm equality proof in zero knowledge for shared secret between two chains with different ec curves. (farcaster)
  - sigma protocols are alternative (COMINT)
* chia
- simpleswap.io swaps xch on kucoin
- Permuto will allow "eligible holders"" to deposit Microsoft stock (MSFT) and issue "dividend" and "appreciation" certificates on the chia blockchain; to be traded seperately. Allowed 10% of total stock and voting is done based on prices of the 'certificates'.
- ~CHIA_ROOT~ env variable configuration
  - burn if not able to melt
- check plots with ~chia plots check -n 30 -l~
#+NAME: chia-burn-addrs
#+BEGIN_SRC org :tangle no
- mainnet burn xch1qqqqqqqqqqqqqqqqqqqqqqqqqqqqqqqqqqqqqqqqqqqqqqqqm6ks6e8mvy
- sends to puzzle hash 0x000000000000000000000000000000000000000000000000000000000000dead
- testnet burn txch1qqqqqqqqqqqqqqqqqqqqqqqqqqqqqqqqqqqqqqqqqqqqqqqqm6ksh7qddh
#+END_SRC
- ~coin_type~ is 8444 in BLS HD key path
- utxo based (not account based like ethereum)
- set env var root with ~export CHIA_ROOT=/usr/local/chia/mainnet/~
- offer files for p2p exchange (atomic swaps)
  - submarine swap cross chain for btc
  - ALL CAT v1 Offers/Coins are INVALID as of 1.5 for vulnerability that allows anyone to claim; replaced by cat v2
    - unable to control amount exploited. puzzle hash, coin amount, parent id are sha256 hashed but not validated. fixed by using shatree to validate.
- proof of space and time
- bls aggregatable signatures
- tail emissions of 0.125 xch per block after 12 years
- pooling protocol for self block creation
- asic timelords
- uses 3 'blockchains' with 1 being a transaction chain of foliage to avoid grinding the canonical trunk chain
- compression of plots [[https://github.com/Chia-Network/chiapos/tree/main/hellman_example][possible]] with [[https://github.com/Chia-Network/proofofspace/blob/master/proof_of_space.md#Hellman-Attacks][Hellman Attack]] by using ram/cpu during plotting/harvesting. (tldr: throws first table away and reverses table 2 as needed)
  - 'bit dropping' is actually used approach
- GPU compressed plot farming for C7(2gb vram) C8(4gb varm) C9(only if free power)
  - GPU plotting from mmx madmax
- chialisp
  - programmable smart contracts
    - autonomous custody with rate limiting, clawback and configurable settlement periods
- chain stats dashboard.chia.net
- xch domains
  - namesdao nft
    - webpages at ~SevenCharName.xch.cm~ and ~SevenCharName.xch.am~
- each CAT v2 is worth 1000 mojos. smallest unit is thus 0.001 CAT or one mojo.
- [[https://info.v2.tibetswap.io/pair/1a6d4f404766f984d014a3a7cab15021e258025ff50481c73ea7c48927bd28af][tibet]] swap amm based on uniswap v1
- https://github.com/dexie-space/splash for decentralized offer broadcasting
#+NAME: chia-namesdao-create
#+BEGIN_SRC sh :tangle no
chia wallet send -a 0.000000000001 -m 0.000000000001 -t xch1jhye8dmkhree0zr8t09rlzm9cc82mhuqtp5tlmsj4kuqvs69s2wsl90su4 -e "___SevenCharName.xch:xchYOURxchaddress" --override
#+END_SRC
- https://pawket.app/ for some online chia tools. debugger coming soon...
  - implemented ecdh for chia addresses
  - ecdh for encrypted messages
- https://github.com/trepca/chirp for chia messages
- 1.43 TB of writes per k32
- data layer added in 1.6
  - store hash in smart coin. updates are tracked on chain along with mirrors
  - http server bundled to download and serve data
    - selectively download layers if inclusion proof is acceptable
  - can store key value pairs of json etc
    - works with offer files
  - ex of video sharing with datalayer https://github.com/jjldv/ChiaTubi
- [[https://mojonode.com/explorer?q=select%20date_trunc(%27week%27,%20gs.ts)%20as%20datetime,%20coalesce(max(reorgs),%200)%20as%20%22max%20seq%20block%20reorgs%20per%20week%22%20from%0A%20%20generate_series(%272022-03-10%2000:00:00%27::timestamp,%20%0A%20%20%272023-03-21%2023:55:00%27::timestamp,%20interval%20%271%20day%27)%20gs(ts)%20%0A%20%20left%20join%20%0A%20%20(%0Aselect%20min(dt)%20as%20dt,%20count(seq)%20as%20reorgs%20from%20(%0A%20%20select%20height,%20max(created_at)%20as%20dt,%0A%20%20%20%20case%20when%20height%20-%20row_number()%20over%20(order%20by%20height)%20=%20-1%20then%20height%20%20%0A%20%20%20%20else%20height%20-%20row_number()%20over%20(order%20by%20height)%20end%20as%20seq%20from%20block_records%20%0Awhere%20reverted=true%0Agroup%20by%20height%0A)%20as%20t%0Agroup%20by%20seq%0A%20%20%20having%20count(seq)%20%3E%200%0A%20%20%20)%20as%20b%20%0A%20%20%20%20%20%0A%20%20%20%20%20on%20date_trunc(%27week%27,%20b.dt)%20=%20date_trunc(%27week%27,%20gs.ts)%0A%20%20%0A%20group%20by%20date_trunc(%27week%27,%20gs.ts)%0Aorder%20by%20date_trunc(%27week%27,%20gs.ts)%20][mojo node sql for block reorg]]
- space farmers pool runs community node
  - light farming alternative since flexpool shutdown
- xch.events for mempool explorer
