cryptocurrency.html
<!DOCTYPE html>
<html lang="en">
<head>
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>cryptocurrency</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="org-default.css" />
</head>
<body>
<div id="content" class="container">
<nav aria-label="breadcrumb" style="--pico-nav-breadcrumb-divider: '|';" id="org07a2d64">
<ul class="org-ul">
<li><a href="index.html#ID-3a34d6d7-6f37-4573-b20e-3c93894e54ac">🏠</a></li>
<li><a href="site_map.html#ID-30ea5e38-9b41-4bcd-8631-76821e93e294">🗺</a></li>
</ul>
</nav>
<div id="outline-container-org7a4bd36" class="outline-2">
<h2 id="org7a4bd36">notes</h2>
<div class="outline-text-2" id="text-org7a4bd36">
<ul class="org-ul">
<li>fallacies of crypto haters
<ul class="org-ul">
<li>wrought with fraud so it needs 'regulation'
<ul class="org-ul">
<li>banks are the biggest scamming hucksters around and they facilitate most of financial fraud in the world within 'regulations'</li>
</ul></li>
<li>not decentralized
<ul class="org-ul">
<li>'people do not want to run their own servers' - moxie marlinspike
<ul class="org-ul">
<li>they will and do; a nakamoto number greater than 1 is still more than the status quo</li>
</ul></li>
</ul></li>
</ul></li>
<li>fallacies of crypto bros
<ul class="org-ul">
<li>'trapped energy'
<ul class="org-ul">
<li>sets lower bound on energy production price beyond the government; thus encourages more production regardless of means</li>
<li>wasting compute cycles on hashing random numbers instead of folding proteins, simulating fluid dynamics, SETI etc (need internet connection for blockchain sync); price should not be the primary factor for investing in hard research problems.</li>
</ul></li>
</ul></li>
<li>cross group discrete logarithm equality proof in zero knowledge for shared secret between two chains with different ec curves. (farcaster)
<ul class="org-ul">
<li>sigma protocols are alternative (COMINT)</li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-orgcfb19fe" class="outline-2">
<h2 id="orgcfb19fe">chia</h2>
<div class="outline-text-2" id="text-orgcfb19fe">
<ul class="org-ul">
<li>simpleswap.io swaps xch on kucoin</li>
<li>Permuto will allow "eligible holders"" to deposit Microsoft stock (MSFT) and issue "dividend" and "appreciation" certificates on the chia blockchain; to be traded seperately. Allowed 10% of total stock and voting is done based on prices of the 'certificates'.</li>
<li><code>CHIA_ROOT</code> env variable configuration
<ul class="org-ul">
<li>burn if not able to melt</li>
</ul></li>
<li>check plots with <code>chia plots check -n 30 -l</code></li>
</ul>
<div class="org-src-container">
<pre class="src src-org" id="orgf8f2e37">- mainnet burn xch1qqqqqqqqqqqqqqqqqqqqqqqqqqqqqqqqqqqqqqqqqqqqqqqqm6ks6e8mvy
- sends to puzzle hash 0x000000000000000000000000000000000000000000000000000000000000dead
- testnet burn txch1qqqqqqqqqqqqqqqqqqqqqqqqqqqqqqqqqqqqqqqqqqqqqqqqm6ksh7qddh
</pre>
</div>
<ul class="org-ul">
<li><code>coin_type</code> is 8444 in BLS HD key path</li>
<li>utxo based (not account based like ethereum)</li>
<li>set env var root with <code>export CHIA_ROOT=/usr/local/chia/mainnet/</code></li>
<li>offer files for p2p exchange (atomic swaps)
<ul class="org-ul">
<li>submarine swap cross chain for btc</li>
<li>ALL CAT v1 Offers/Coins are INVALID as of 1.5 for vulnerability that allows anyone to claim; replaced by cat v2
<ul class="org-ul">
<li>unable to control amount exploited. puzzle hash, coin amount, parent id are sha256 hashed but not validated. fixed by using shatree to validate.</li>
</ul></li>
</ul></li>
<li>proof of space and time</li>
<li>bls aggregatable signatures</li>
<li>tail emissions of 0.125 xch per block after 12 years</li>
<li>pooling protocol for self block creation</li>
<li>asic timelords</li>
<li>uses 3 'blockchains' with 1 being a transaction chain of foliage to avoid grinding the canonical trunk chain</li>
<li>compression of plots <a href="https://github.com/Chia-Network/chiapos/tree/main/hellman_example">possible</a> with <a href="https://github.com/Chia-Network/proofofspace/blob/master/proof_of_space.md#Hellman-Attacks">Hellman Attack</a> by using ram/cpu during plotting/harvesting. (tldr: throws first table away and reverses table 2 as needed)
<ul class="org-ul">
<li>'bit dropping' is actually used approach</li>
</ul></li>
<li>GPU compressed plot farming for C7(2gb vram) C8(4gb varm) C9(only if free power)
<ul class="org-ul">
<li>GPU plotting from mmx madmax</li>
</ul></li>
<li>chialisp
<ul class="org-ul">
<li>programmable smart contracts
<ul class="org-ul">
<li>autonomous custody with rate limiting, clawback and configurable settlement periods</li>
</ul></li>
</ul></li>
<li>chain stats dashboard.chia.net</li>
<li>xch domains
<ul class="org-ul">
<li>namesdao nft
<ul class="org-ul">
<li>webpages at <code>SevenCharName.xch.cm</code> and <code>SevenCharName.xch.am</code></li>
</ul></li>
</ul></li>
<li>each CAT v2 is worth 1000 mojos. smallest unit is thus 0.001 CAT or one mojo.</li>
<li><a href="https://info.v2.tibetswap.io/pair/1a6d4f404766f984d014a3a7cab15021e258025ff50481c73ea7c48927bd28af">tibet</a> swap amm based on uniswap v1</li>
<li><a href="https://github.com/dexie-space/splash">https://github.com/dexie-space/splash</a> for decentralized offer broadcasting</li>
</ul>
<div class="org-src-container">
<pre class="src src-sh" id="orgf224f0c">chia wallet send -a 0.000000000001 -m 0.000000000001 -t xch1jhye8dmkhree0zr8t09rlzm9cc82mhuqtp5tlmsj4kuqvs69s2wsl90su4 -e "___SevenCharName.xch:xchYOURxchaddress" --override
</pre>
</div>
<ul class="org-ul">
<li><a href="https://pawket.app/">https://pawket.app/</a> for some online chia tools. debugger coming soon&#x2026;
<ul class="org-ul">
<li>implemented ecdh for chia addresses</li>
<li>ecdh for encrypted messages</li>
</ul></li>
<li><a href="https://github.com/trepca/chirp">https://github.com/trepca/chirp</a> for chia messages</li>
<li>1.43 TB of writes per k32</li>
<li>data layer added in 1.6
<ul class="org-ul">
<li>store hash in smart coin. updates are tracked on chain along with mirrors</li>
<li>http server bundled to download and serve data
<ul class="org-ul">
<li>selectively download layers if inclusion proof is acceptable</li>
</ul></li>
<li>can store key value pairs of json etc
<ul class="org-ul">
<li>works with offer files</li>
</ul></li>
<li>ex of video sharing with datalayer <a href="https://github.com/jjldv/ChiaTubi">https://github.com/jjldv/ChiaTubi</a></li>
</ul></li>
<li><a href="https://mojonode.com/explorer?q=select%20date_trunc(%27week%27,%20gs.ts)%20as%20datetime,%20coalesce(max(reorgs),%200)%20as%20%22max%20seq%20block%20reorgs%20per%20week%22%20from%0A%20%20generate_series(%272022-03-10%2000:00:00%27::timestamp,%20%0A%20%20%272023-03-21%2023:55:00%27::timestamp,%20interval%20%271%20day%27)%20gs(ts)%20%0A%20%20left%20join%20%0A%20%20(%0Aselect%20min(dt)%20as%20dt,%20count(seq)%20as%20reorgs%20from%20(%0A%20%20select%20height,%20max(created_at)%20as%20dt,%0A%20%20%20%20case%20when%20height%20-%20row_number()%20over%20(order%20by%20height)%20=%20-1%20then%20height%20%20%0A%20%20%20%20else%20height%20-%20row_number()%20over%20(order%20by%20height)%20end%20as%20seq%20from%20block_records%20%0Awhere%20reverted=true%0Agroup%20by%20height%0A)%20as%20t%0Agroup%20by%20seq%0A%20%20%20having%20count(seq)%20%3E%200%0A%20%20%20)%20as%20b%20%0A%20%20%20%20%20%0A%20%20%20%20%20on%20date_trunc(%27week%27,%20b.dt)%20=%20date_trunc(%27week%27,%20gs.ts)%0A%20%20%0A%20group%20by%20date_trunc(%27week%27,%20gs.ts)%0Aorder%20by%20date_trunc(%27week%27,%20gs.ts)%20">mojo node sql for block reorg</a></li>
<li>space farmers pool runs community node
<ul class="org-ul">
<li>light farming alternative since flexpool shutdown</li>
</ul></li>
<li>xch.events for mempool explorer</li>
</ul>
</div>
