org/roam/cryptocurrency.org
** blunders
- Stably provider scammed with PrimeTrust USDS and wrapper btc redemption disabling
 - 0.59 btc in reserved. Required 1btc deposit to withdrawl.
- CEO/CSO/Employees flame users on reddit (ex. Windows SSL issue)
- Trademark trolling chiaplot (news site)/xchscan(block explorer) with fresh law grad
  - the chia plot needed a lawyer for them to buzz off
- large premine (promised to not use) is being used(sold) to 'marketing' and 'market makers'
- layoff of devs after being told "we have years of runway"
- hiring WEF managers and fossils(L. Goldman) for DevRel.
- Gatekeeping timelord asics
- exploited own vulnerability with catv1/v2 upgrade
- stably scam
  - chia has better custody tools than custodian. Total lack of DD
- misrepresent the plot filter increase and effects it will have on farming k32's
  - higher quality proofs will be more likely to win. k33 will provide higher proof quality than k32 given same storage space.
- Slow development
  - pooling release
  - compressed plots
    - announced needing new plot format but still bought drplotter compressed farmer
  - node perf (dust storm)
  - no blockchain download for years (offer torrent now)
- atomic swaps and zkrollups not integrated into client for years
* monero
- use block > 2,688,888 restore height for faster sync times with view tag support (resend old funds etc)
- supports tor with sending tx's and wallets
  - ~tx-proxy~ for sending transactions
  - ~anonymous-inbound~ allow inbound transactions
- randomx for POW algorithm
  - ASIC resistance may not be stable long term
    - advertised asic miners contest specific nonces (horizontal lines on graph of block nonces)
      - potential for social cascading for miners to skip those nonces (making the asics better?)
- tail emissions of 0.6 XMR per block
- variable block sizes
  - potential difficulty/timestamp grinding but at cost
- p2pool for distributed block creation
  - needs zmq enabled monerod
  - bundled with gui in 0.18
  - mini side chain for lower hashrate
  - xmrvsbeast raffle bonus
- ringct
  - bulletproofs
  - ring signatures to obsurce sender, amount, recipient
    - can still trace 'outputs' if you are the sends (alice bob alice attack) or if network is deanonymized (exchanges/users publish view keys, block reward before if enters txo set, transaction fee correlation)
      - churn to avoid and create noise
- stealth addresses
  - random 1 time addresses for every transaction
- Dandelion++
  - transaction broadcast and peer sampling to prevent tracing tx origins
- No light/SPV clients
  - view tags since v0.18
- lockable spends with ~locked_transfer~
- [[https://github.com/spackle-xmr/MoneroTools][churn, fracture and consolidate tools]]
- haveno for p2p order book https://blog.nihilism.network/servers/haveno-client-f2f/index.html
  - ~make haveno-apps && make haveno-desktop-mainnet~ or ~./gradlew --no-daemon :core:compileJava :desktop:build -x test -x checkstyleMain -x checkstyleTest~
    - ~guix package -i monero tor gtk+ mesa libxxf86vm libx11 openjdk:jdk~
    - ~CookieAuthentication 1~ and ~ControlPort 9051~ in ~tor -f .torrc~
    - ~ln -s ~/.guix-profile/monero-wallet-rpc~ and ~/.guix-profile/bin/monerod to ~/.local/share/Haveno-reto
    - ~LD_LIBRARY_PATH=~/.guix-profile/lib/ ./haveno-desktop --torControlPort='9051' --torControlCookieFile=$HOME/.tor/control_auth_cookie --torControlUseSafeCookieAuth --useTorForXmr='on' --socks5ProxyXmrAddress='127.0.0.1:9050' --baseCurrencyNetwork=XMR_MAINNET --useLocalhostForP2P=false --useDevPrivilegeKeys=false --nodePort=9999 --appName=Haveno-reto --apiPassword=apitest --apiPort=1201 --useNativeXmrWallet=false --ignoreLocalXmrNode=fals~
  - reto simplex https://smp5.simplex.im/g#-_h6fBWisca6RKhteZtVuXol1a49vFH1Jo-n74fnRK0
#+NAME: xmr-script
#+BEGIN_SRC sh :tangle no
#!/bin/bash -e

# https://xmrig.com/docs/miner/hugepages#onegb-huge-pages

sysctl -w vm.nr_hugepages=$(nproc)

for i in $(find /sys/devices/system/node/node* -maxdepth 0 -type d);
do
    echo 3 > "$i/hugepages/hugepages-1048576kB/nr_hugepages";
done

echo "1GB pages successfully enabled"

#guix pack -S /bin=bin -f docker --with-commit=p2pool=6cf1b13500795260fd9b98de393ecd19f5aabd5d p2pool

# forward TCP for monerod
#upnpc -e monero -r 18080 TCP

# p2pool mini chain
#upnpc -e p2pool -r 37889 TCP

# p2pool chain
#upnpc -e p2pool -r 37888 TCP

sudo xmrig --randomx-1gb-pages --huge-pages-jit -t 12 -o 127.0.0.1:3333  -B

#+END_SRC

* bitcoin
- reuse of ECDSA signatures can lead to key compromise (polynonce attack). use deterministic dsa instead (eddsa or RFC 6979)
- double sha256
- fixed block size
- fixed supply ~21m
- lightning
  - hash time locked contacts
    - moving to point time locked contracts
  - rebalance incoming/outgoing channels for sending/receiving/routing
  - preimage based
  - watchtowers
    - monitor channel transactions and punish bad actors incase of attack on your node (publishing false state to chain) by publishing new state and penalizing
  - taro for colored coins/assets
- bip 351 payment codes for private transactions
- fedimint - protocol for multisig group m:n (federation) that issues 'ecash' that is backed by sats. Tradable with other federation members (half-online). No/lower fees are not written to chain unless ecash is turned into sats by federation.
