cryptocurrency.html
<div id="outline-container-orgfc2674c" class="outline-3">
<h3 id="orgfc2674c">blunders</h3>
<div class="outline-text-3" id="text-orgfc2674c">
<ul class="org-ul">
<li>Stably provider scammed with PrimeTrust USDS and wrapper btc redemption disabling
<ul class="org-ul">
<li>0.59 btc in reserved. Required 1btc deposit to withdrawl.</li>
</ul></li>
<li>CEO/CSO/Employees flame users on reddit (ex. Windows SSL issue)</li>
<li>Trademark trolling chiaplot (news site)/xchscan(block explorer) with fresh law grad
<ul class="org-ul">
<li>the chia plot needed a lawyer for them to buzz off</li>
</ul></li>
<li>large premine (promised to not use) is being used(sold) to 'marketing' and 'market makers'</li>
<li>layoff of devs after being told "we have years of runway"</li>
<li>hiring WEF managers and fossils(L. Goldman) for DevRel.</li>
<li>Gatekeeping timelord asics</li>
<li>exploited own vulnerability with catv1/v2 upgrade</li>
<li>stably scam
<ul class="org-ul">
<li>chia has better custody tools than custodian. Total lack of DD</li>
</ul></li>
<li>misrepresent the plot filter increase and effects it will have on farming k32's
<ul class="org-ul">
<li>higher quality proofs will be more likely to win. k33 will provide higher proof quality than k32 given same storage space.</li>
</ul></li>
<li>Slow development
<ul class="org-ul">
<li>pooling release</li>
<li>compressed plots
<ul class="org-ul">
<li>announced needing new plot format but still bought drplotter compressed farmer</li>
</ul></li>
<li>node perf (dust storm)</li>
<li>no blockchain download for years (offer torrent now)</li>
</ul></li>
<li>atomic swaps and zkrollups not integrated into client for years</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-orgee84784" class="outline-2">
<h2 id="orgee84784">monero</h2>
<div class="outline-text-2" id="text-orgee84784">
<ul class="org-ul">
<li>use block &gt; 2,688,888 restore height for faster sync times with view tag support (resend old funds etc)</li>
<li>supports tor with sending tx's and wallets
<ul class="org-ul">
<li><code>tx-proxy</code> for sending transactions</li>
<li><code>anonymous-inbound</code> allow inbound transactions</li>
</ul></li>
<li>randomx for POW algorithm
<ul class="org-ul">
<li>ASIC resistance may not be stable long term
<ul class="org-ul">
<li>advertised asic miners contest specific nonces (horizontal lines on graph of block nonces)
<ul class="org-ul">
<li>potential for social cascading for miners to skip those nonces (making the asics better?)</li>
</ul></li>
</ul></li>
</ul></li>
<li>tail emissions of 0.6 XMR per block</li>
<li>variable block sizes
<ul class="org-ul">
<li>potential difficulty/timestamp grinding but at cost</li>
</ul></li>
<li>p2pool for distributed block creation
<ul class="org-ul">
<li>needs zmq enabled monerod</li>
<li>bundled with gui in 0.18</li>
<li>mini side chain for lower hashrate</li>
<li>xmrvsbeast raffle bonus</li>
</ul></li>
<li>ringct
<ul class="org-ul">
<li>bulletproofs</li>
<li>ring signatures to obsurce sender, amount, recipient
<ul class="org-ul">
<li>can still trace 'outputs' if you are the sends (alice bob alice attack) or if network is deanonymized (exchanges/users publish view keys, block reward before if enters txo set, transaction fee correlation)
<ul class="org-ul">
<li>churn to avoid and create noise</li>
</ul></li>
</ul></li>
</ul></li>
<li>stealth addresses
<ul class="org-ul">
<li>random 1 time addresses for every transaction</li>
</ul></li>
<li>Dandelion++
<ul class="org-ul">
<li>transaction broadcast and peer sampling to prevent tracing tx origins</li>
</ul></li>
<li>No light/SPV clients
<ul class="org-ul">
<li>view tags since v0.18</li>
</ul></li>
<li>lockable spends with <code>locked_transfer</code></li>
<li><a href="https://github.com/spackle-xmr/MoneroTools">churn, fracture and consolidate tools</a></li>
<li>haveno for p2p order book <a href="https://blog.nihilism.network/servers/haveno-client-f2f/index.html">https://blog.nihilism.network/servers/haveno-client-f2f/index.html</a>
<ul class="org-ul">
<li><code>make haveno-apps &amp;&amp; make haveno-desktop-mainnet</code> or <code>./gradlew --no-daemon :core:compileJava :desktop:build -x test -x checkstyleMain -x checkstyleTest</code>
<ul class="org-ul">
<li><code>guix package -i monero tor gtk+ mesa libxxf86vm libx11 openjdk:jdk</code></li>
<li><code>CookieAuthentication 1</code> and <code>ControlPort 9051</code> in <code>tor -f .torrc</code></li>
<li><code>ln -s ~/.guix-profile/monero-wallet-rpc</code> and ~/.guix-profile/bin/monerod to ~/.local/share/Haveno-reto</li>
<li><code>LD_LIBRARY_PATH=~/.guix-profile/lib/ ./haveno-desktop --torControlPort='9051' --torControlCookieFile=$HOME/.tor/control_auth_cookie --torControlUseSafeCookieAuth --useTorForXmr='on' --socks5ProxyXmrAddress='127.0.0.1:9050' --baseCurrencyNetwork=XMR_MAINNET --useLocalhostForP2P=false --useDevPrivilegeKeys=false --nodePort=9999 --appName=Haveno-reto --apiPassword=apitest --apiPort=1201 --useNativeXmrWallet=false --ignoreLocalXmrNode=fals</code></li>
</ul></li>
<li>reto simplex <a href="https://simplex.chat/contact#/?v=2-4&amp;smp=smp%3A%2F%2FSkIkI6EPd2D63F4xFKfHk7I1UGZVNn6k1QWZ5rcyr6w%3D%40smp9.simplex.im%2FMplYm7uxopKyUOrKqnWySpXQIGxoJWYB%23%2F%3Fv%3D1-2%26dh%3DMCowBQYDK2VuAyEAs8PcRwnf_-H30yXfwV0MSbka9I_xBeVNr4vKJNoReBw%253D%26srv%3Djssqzccmrcws6bhmn77vgmhfjmhwlyr3u7puw4erkyoosywgl67slqqd.onion&amp;data=%7B%22type%22%3A%22group%22%2C%22groupLinkId%22%3A%22YT2t__GnjpZ1W2MjJAz6Sw%3D%3D%22%7D">https://simplex.chat/contact#/?v=2-4&amp;smp=smp%3A%2F%2FSkIkI6EPd2D63F4xFKfHk7I1UGZVNn6k1QWZ5rcyr6w%3D%40smp9.simplex.im%2FMplYm7uxopKyUOrKqnWySpXQIGxoJWYB%23%2F%3Fv%3D1-2%26dh%3DMCowBQYDK2VuAyEAs8PcRwnf_-H30yXfwV0MSbka9I_xBeVNr4vKJNoReBw%253D%26srv%3Djssqzccmrcws6bhmn77vgmhfjmhwlyr3u7puw4erkyoosywgl67slqqd.onion&amp;data=%7B%22type%22%3A%22group%22%2C%22groupLinkId%22%3A%22YT2t__GnjpZ1W2MjJAz6Sw%3D%3D%22%7D</a></li>
</ul></li>
</ul>
<div class="org-src-container">
<pre class="src src-sh" id="org64cc160">#!/bin/bash -e

# https://xmrig.com/docs/miner/hugepages#onegb-huge-pages

sysctl -w vm.nr_hugepages=$(nproc)

for i in $(find /sys/devices/system/node/node* -maxdepth 0 -type d);
do
    echo 3 &gt; "$i/hugepages/hugepages-1048576kB/nr_hugepages";
done

echo "1GB pages successfully enabled"

#guix pack -S /bin=bin -f docker --with-commit=p2pool=6cf1b13500795260fd9b98de393ecd19f5aabd5d p2pool

# forward TCP for monerod
#upnpc -e monero -r 18080 TCP

# p2pool mini chain
#upnpc -e p2pool -r 37889 TCP

# p2pool chain
#upnpc -e p2pool -r 37888 TCP

sudo xmrig --randomx-1gb-pages --huge-pages-jit -t 12 -o 127.0.0.1:3333  -B

</pre>
</div>
</div>
</div>
<div id="outline-container-org9b32bea" class="outline-2">
<h2 id="org9b32bea">bitcoin</h2>
<div class="outline-text-2" id="text-org9b32bea">
<ul class="org-ul">
<li>reuse of ECDSA signatures can lead to key compromise (polynonce attack). use deterministic dsa instead (eddsa or RFC 6979)</li>
<li>double sha256</li>
<li>fixed block size</li>
<li>fixed supply ~21m</li>
<li>lightning
<ul class="org-ul">
<li>hash time locked contacts
<ul class="org-ul">
<li>moving to point time locked contracts</li>
</ul></li>
<li>rebalance incoming/outgoing channels for sending/receiving/routing</li>
<li>preimage based</li>
<li>watchtowers
<ul class="org-ul">
<li>monitor channel transactions and punish bad actors incase of attack on your node (publishing false state to chain) by publishing new state and penalizing</li>
</ul></li>
<li>taro for colored coins/assets</li>
</ul></li>
<li>bip 351 payment codes for private transactions</li>
<li>fedimint - protocol for multisig group m:n (federation) that issues 'ecash' that is backed by sats. Tradable with other federation members (half-online). No/lower fees are not written to chain unless ecash is turned into sats by federation.</li>
</ul>
</div>
</div>
