cryptocurrency.html
<div id="outline-container-org7b97374" class="outline-2">
<h2 id="org7b97374">btcpayserver</h2>
<div class="outline-text-2" id="text-org7b97374">
<ul class="org-ul">
<li>crypto payment server that supports invoices (multiple payments, refunds, tolerances etc)</li>
<li>xmr config requires the view only wallet.keys, wallet and password file be available before sync can complete</li>
<li>sync MUST be completed before the FIRST store can be created</li>
</ul>
<div class="org-src-container">
<pre class="src src-yaml" id="org8a5dcb2">apiVersion: apps/v1
kind: Deployment
metadata:
  name: btcpay-deployment
  labels:
    app: btcpay
spec:
  replicas: 1
  selector:
    matchLabels:
      app: btcpay
  template:
    metadata:
      labels:
        app: btcpay
    spec:
      volumes:
      - name: btcpay-data
        hostPath:
          path: /storage/btcpay/btcpay-data
      - name: btcpay-plugins
        hostPath:
          path: /storage/btcpay/btcpay-plugins
      - name: postgres-data
        hostPath:
          path: /storage/btcpay/btcpay-postgres
      - name: monero-config
        hostPath:
          path: /storage/btcpay/btcpay-bitmonero
      - name: monero-wallet
        hostPath:
          path: /storage/btcpay/btcpay-xmr-wallet
      containers:
      - name: btcpay
        image: btcpayserver/btcpayserver:1.7.1-altcoins
        volumeMounts:
        - name: btcpay-data
          mountPath: /datadir
        - name: btcpay-plugins
          mountPath: /root/.btcpayserver/Plugins
        - name: monero-wallet
          mountPath: /root/xmr_wallet
        env:
        - name: BTCPAY_POSTGRES
          value: "User ID=postgres;Host=127.0.0.1;Port=5432;Application Name=btcpayserver;Database=btcpayserver"
        - name: BTCPAY_NETWORK
          value: regtest
        - name: BTCPAY_BIND
          value: 0.0.0.0:49392
        - name: BTCPAY_ROOTPATH
          value: /
        - name: BTCPAY_SSHCONNECTION
          value: "root@host.docker.internal"
        - name: BTCPAY_SSHTRUSTEDFINGERPRINTS
          value: ""
        - name: BTCPAY_SSHKEYFILE
          value: ""
        - name: BTCPAY_SSHAUTHORIZEDKEYS
          value: ""
        - name: BTCPAY_DEBUGLOG
          value: btcpay.log
        - name: BTCPAY_UPDATEURL
          value: https://api.github.com/repos/btcpayserver/btcpayserver/releases/latest
        - name: BTCPAY_DOCKERDEPLOYMENT
          value: "true"
        - name: BTCPAY_CHAINS
          value: "xmr"
        - name: BTCPAY_XMR_DAEMON_URI
          value: http://127.0.0.1:18081
        - name: BTCPAY_XMR_WALLET_DAEMON_URI
          value: http://127.0.0.1:18082
        - name: BTCPAY_XMR_WALLET_DAEMON_WALLETDIR
          value: /root/xmr_wallet
        ports:
        - name: btcpay-port
          containerPort: 49392
          hostPort: 49392
      - name: monerod
        image: btcpayserver/monero:0.18.1.0-amd64 # needs Containerfile with EXPOSE 18084 for p2pool zmq
        volumeMounts:
        - name: monero-config
          mountPath: /home/monero/.bitmonero
        args: ["--no-zmq", "--rpc-bind-ip=0.0.0.0", "--confirm-external-bind", "--rpc-bind-port=18081", "--non-interactive", "--hide-my-port", "--prune-blockchain", "--disable-dns-checkpoints", "--enable-dns-blocklist", "--block-notify", "/bin/sh ./scripts/notifier.sh -X GET http://127.0.0.1:49392/monerolikedaemoncallback/block?cryptoCode=xmr&amp;hash=%s"] # "--zmq-pub", "tcp://127.0.0.1:18084", "--limit-rate-up", "800", "--out-peers", "30",
        command: ["monerod"]
        ports:
        - name: monero-rpc
          containerPort: 18081
          hostPort: 18081
      - name: monerod-wallet
        image: btcpayserver/monero:0.18.1.0-amd64
        volumeMounts:
        - name: monero-wallet
          mountPath: /wallet
        args: ["--rpc-bind-ip=0.0.0.0", "--disable-rpc-login", "--confirm-external-bind", "--rpc-bind-port=18082", "--non-interactive", "--trusted-daemon", "--daemon-address=127.0.0.1:18081", "--wallet-file=/wallet/wallet", "--password-file=/wallet/password", "--tx-notify", "/bin/sh ./scripts/notifier.sh  -X GET http://127.0.0.1:49392/monerolikedaemoncallback/tx?cryptoCode=xmr&amp;hash=%s"]
        command: ["monero-wallet-rpc"]
        ports:
        - name: monero-daemon-rpc
          containerPort: 18082
          hostPort: 18082
      - name: postgres
        image: btcpayserver/postgres:13.7
        volumeMounts:
        - name: postgres-data
          mountPath: /var/lib/postgresql/data
        args: ["-c", "random_page_cost=1.0", "-c", "shared_preload_libraries=pg_stat_statements"]
        env:
        - name: POSTGRES_HOST_AUTH_METHOD
          value: trust
        ports:
        - name: postgres-port
          containerPort: 5432
          hostPort: 5432
</pre>
</div>
</div>
</div>
</div>
</body>
</html>
